Revit 2026 API

# TileTileMortarColor Property

---

The property labeled "Grout Color" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileMortarColor { get; }
```
```vb
Public Shared ReadOnly Property TileMortarColor As String
	Get
```
```cpp
public:
static property String^ TileMortarColor {
	String^ get ();
}
```
```fsharp
static member TileMortarColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace